jorgebucaran/fisher
catppuccin/fish
patrickf1/fzf.fish
decors/fish-colored-man
danhper/fish-ssh-agent
franciscolourenco/done
kidonng/zoxide.fish
jorgebucaran/autopair.fish
nickeb96/puffer-fish
wfxr/forgit
gazorby/fish-exa
rstacruz/fish-asdf
evanlucas/fish-kubectl-completions
