cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "d12frosted/emacs-plus"

brew "git"
brew "zsh"
brew "ag"
brew "ruby"
brew "tree"
brew "jq"
brew "vim", args: ["--with-override-system-vi"]
brew "go", args: ["--cross-compile-common"]
brew "rustup"
brew "multimarkdown"

cask "emacs-plus@28"
cask "font-source-code-pro"
cask "1Password"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "kindle"
cask "spotify"
cask "basictex"
cask "synology-drive"
cask "docker"
