cask_args appdir: "/Applications"

tap "d12frosted/emacs-plus"
tap "caskroom/cask"
tap "caskroom/fonts"

brew "git"
brew "zsh"
brew "ag"
brew "ruby"
brew "tree"
brew "jq"
brew "emacs-plus", args: ["--without-spacemacs-icon" "--with-natural-title-bar"]
brew "vim", args: ["--with-override-system-vi"]

cask "font-source-code-pro"
cask "1Password"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "kindle"
cask "spotify"
cask "basictex"
