cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "d12frosted/emacs-plus"

brew "git"
brew "zsh"
brew "ag"
brew "ruby"
brew "tree"
brew "jq"
brew "vim"
brew "emacs-plus@29"

cask "font-source-code-pro"
cask "bitwarden"
cask "google-chrome"
cask "spotify"
cask "docker"
cask "finicky"
cask "raycast"
cask "visual-studio-code"
